if(msg.includes('.점심메뉴추천') || msg.includes('.점메추')){
    var menus = ['돈까스','평양냉면','파스타','라멘', '리조또','계란볶음밥', '만두국', '순두부찌개', '김치찌개', '부대찌개','차돌된장찌개', 
    '제육볶음', '순대국밥','만두국','칼국수','샤브샤브','훠궈','등촌칼국수', '샐러드', '떡라면', '만두라면', '육회비빔밥', '오징어볶음', '떡볶이', '라볶이', 
    '마라탕', '짜장면', '짬뽕밥', '카레라이스', '돈까스카레', '돈부리', '회덮밥', '우삼겹메밀면', '피자', '돌솥비빔밥','바지락칼국수','뼈해장국', '소불고기','삼계탕','육개장','초계국수','철판닭갈비','냉면','밀면','팟타이', '갈비탕'];
    if(msg.includes('헬창')){
        menus = ['청양고추맛 닭가슴살', "그냥 닭가슴살","나우 무맛 웨이프로틴", "브로콜리 + 닭가슴살 + 현미밥", "오트밀", "마이프로틴 네-추랄 초콜릿맛 웨이프로틴", "고추장맛 닭가슴살", "매우 퍽퍽한 목살", "갈비맛 닭가슴살", "양념치킨맛 닭가슴살"];
    }
    var index = Math.floor(Math.random() * menus.length);
    
    replier.reply(sender + '님, 점심메뉴로 [' + menus[index] +']은(는) 어떠세요? (꺄아)');
  } 
var menus2 = [
'삼겹살', '모듬회', '숙성회', '초밥', '소고기', '방어회', '감자탕', '파스타', '쭈꾸미볶음', 
'골뱅이무침', '수제비', '치킨', '피자', '만두전골', '스테이크', '돼지막창', '소곱창', '해물찜', 
'오리로스구이', '바지락칼국수', '숯불닭갈비', '불고기', '랍스터', '해물탕', '갈비찜', '떡볶이', 
'잡채', '김치찌개', '부대찌개', '돈가스', '샤브샤브', '탕수육', '팟타이', '라멘', '비빔밥', 
'덮밥', '돈부리', '토마토 스파게티', '마르게리타 피자', '해산물 파에야', '램찹', '베이컨 철판볶음밥',
'멕시칸 타코', '인도 커리', '팟타이', '훠궈', '칠리크랩', '쌀국수', '페퍼로니 피자', '포크립', 
'그릴드 샐몬', '로브스터 롤', '마파두부', '킹크랩', '알리오올리오 파스타', '차돌박이', '야채볶음', 
'소시지', '오므라이스', '포테이토 칩스', '피쉬 앤 칩스', '버터 치킨 커리', '게살 케이크', '두부 스테이크', 
'냉면', '닭가슴살 샐러드', '치즈 플래터', '토마토 수프', 
'스시', '버터 마늘 새우', '푸아그라', '에그 베네딕트', '타코 샐러드', '후무스', '퀘사디아', 
'양념치킨', '에그타르트', '크레페', '마끼롤', '캘리포니아 롤', '소바', '우동', '케밥', '짜장면', 
'짬뽕', '코코넛 새우', '시저 샐러드', '코울슬로','굶기'
];
var drunkList = ['소주','소주','소주','소주','소주','소주', '맥주', '럼주', '몰트 위스키','버번 위스키', '보드카', '진', '막걸리', '사케', '레드 와인', '화이트 와인', '피트 와인'];

if(msg.includes('.저녁메뉴추천') || msg.includes('.저메추')){
    if(msg.includes('헬창')){
        menus2 = ['청양고추맛 닭가슴살', "그냥 닭가슴살","나우 무맛 웨이프로틴", "브로콜리 + 닭가슴살 + 현미밥", "오트밀", "마이프로틴 네-추랄 초콜릿맛 웨이프로틴", "고추장맛 닭가슴살", "매우 퍽퍽한 목살", "갈비맛 닭가슴살", "양념치킨맛 닭가슴살"];
    }
    var index2 = Math.floor(Math.random() * menus2.length);
    replier.reply(sender + '님, 저녁메뉴로 [' + menus2[index2] +']은(는) 어떠세요? (굿)');
  } else if(msg == '.술추천'){
    index2 = Math.floor(Math.random() * menus2.length);
    var drunkIdx = Math.floor(Math.random() * drunkList.length);

    var drunkEmo = '(와인)';

    if (drunkList[drunkIdx] == '소주'){ 
        drunkEmo = '(소주)';
    }else if(drunkList[drunkIdx] == '맥주'){
        drunkEmo = '(맥주)';
    }else if(drunkList[drunkIdx].includes('위스키') || drunkList[drunkIdx].includes('보드카')){
        drunkEmo = '🥃';
    }else if(drunkList[drunkIdx].includes('사케')){
        drunkEmo = '🍶';
    }else if(drunkList[drunkIdx].includes('막걸리')){
        drunkEmo = '🍵';
    }
    replier.reply(sender + '님, 안주로 [' + menus2[index2] +'] 드시고 술은 [' + drunkList[drunkIdx] + '] 드시는건 어떠세요? ' + drunkEmo);

}



if(msg.includes("해병님")){
    var marin = ["아쎄이 기열..!", sender + "새끼..포신항문해병직할오도짜세기합광역특별자치시를 탈환하기 위해 작전을 세운다!", "악!", "어떤 기열찐빠가 날불렀어? " + sender + ", 너야?", sender + ", 너의 목숨을 건 짜장만들기를 시작한다.", "라이라이 차차차!!!", "아아.. 그 유쾌한 여흥이란..", "아쎄이..전우애를 느끼고싶나..?"];
    var marinIdx = Math.floor(Math.random() * marin.length);
    replier.reply(marin[marinIdx]);
}


if(msg=='.이준영 머리뽑기'){
    var num = Math.floor(Math.random());
    replier.reply("이준영의 머리카락 [" +num + "]가닥 뽑았습니다!");
}